<!-- dflook/terraform-github-actions {"workspace":"fix-react-2","backend_type":"remote","backend":"d92bc17d87c025e70942c0d78db4e42ee588a349d5c1a095cd6a51951f683414","plan_job_ref":"Job Test Terraform cloud #135 at https://github.com/dflook/terraform-github-actions/actions/runs/4079409929","plan_hash":"1c514e8c5af9cbd0d4bacce476e17c344f18d836fb65044e2a0806562b45294c","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __fix-react-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #135](https://github.com/dflook/terraform-github-actions/actions/runs/4079409929)